{
  "blog_number": 1,
  "title": "Elon Musk's xAI Might Be Hallucinating Its Chances Against ChatGPT",
  "date": "7/25/2022",
  "description": "Elon Musk’s new venture aims to create AI that can “understand the universe” and challenge OpenAI. Right now it’s 11 male researchers with a lot of work to do.",
  "categories": [
    "tech",
    "musk"
  ],
  "author": "Swapnil Suman",
  "thumbnail": "https://picsum.photos/330/205",
  "content": [
    {
      "introduction": "IN APRIL, ELON Musk told right-wing commentator Tucker Carlson that he was starting a project to compete with ChatGPT and build “a maximum truth-seeking AI that tries to understand the nature of the universe.”",
      "main-image": "https://picsum.photos/900/449"
    },
    {
      "subheading": "Where Musk Stands Today",
      "image" : "https://picsum.photos/600/330",
      "content": "Today, Musk unveiled that new artificial intelligence venture. It’s called xAI. The company’s spare landing page repeats that goal of understanding the universe and lists 11 AI researchers—seemingly all men—who have made significant contributions to the field of AI in recent years and worked at companies including Google, DeepMind, and OpenAI."
    },
    {
      "subheading": "Comapnies later ambitions",
      "image" : "https://picsum.photos/600/330",
      "content": "One of the company’s cofounders, Greg Wang, said in a tweet that xAI aims to take AI to the next level by developing a mathematical “‘theory of everything’ for large neural networks,” the machine learning technology that has dominated AI for the past decade. “This AI will enable everyone to understand our mathematical universe in ways unimaginable before,” he wrote."
    },
    {
      "subheading": "My opinion on all this",
      "image" : "https://picsum.photos/600/330",
      "content": "Musk is no stranger to making bold bets, but what little has been revealed of xAIs goals sounds a little odd. ChatGPT and its rivals such as Google’s Bard are built on deep learning, and OpenAI’s CEO Sam Altman has said wholly new ideas are needed to push beyond existing systems. Researching the fundamentals of the technology could help find them.But much of the recent progress in AI has come from making existing systems bigger and throwing more computing power and data at them. And the sweeping changes AI is expected to deliver in tech and other industries over the next few years will come from deploying that mostly-mature technology.At this stage, xAI seems likely to lack the cloud computing power needed to match OpenAI, Microsoft, and Google. And its relatively small team of AI researchers does not look world-beating compared to the hundreds that each of those established firms can deploy on AI projects. The only person involved who has a history of working on AI risks is xAI’s sole named advisor, Dan Hendrycks, who is director of the nonprofit Center for AI Safety and coordinated a recent public statement from tech leaders about the existential threat AI may pose.Although his supposedly giant-killing AI project is starting small, Musk does, of course, have some significant resources to draw on. The new company will work closely with Twitter and Tesla, according to the xAI website. Twitter’s data from conversations on the platform is well suited to training large language models like that behind ChatGPT, and Tesla now designs its own specialized AI chips and has significant experience building large computing clusters for AI, which could be used to boost xAI’s cloud computing power. Tesla is also building a humanoid robot, a project that could be helped by, and be helpful to, xAI in future."
    }
  ]
}